Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/edc/PIC32MK0512GPL100.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="---------nnnnnnnnnn---nnnnn-----" edc:cname="IntCtl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="IntCtl" edc:nmmrflags="0a" edc:nmmrid="304" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="VS" edc:desc="" edc:mask="0x1f" edc:name="VS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="USESTK" edc:desc="" edc:mask="0x1" edc:name="USESTK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APE" edc:desc="" edc:mask="0x1" edc:name="APE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLREXL" edc:desc="" edc:mask="0x1" edc:name="CLREXL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STKDEC" edc:desc="" edc:mask="0x1f" edc:name="STKDEC" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ICE" edc:desc="" edc:mask="0x1" edc:name="ICE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PF" edc:desc="" edc:mask="0x1" edc:name="PF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="--rrrr----rrrr--nnnn--nnnn--rrrr" edc:cname="SRSCtl" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00011100000000000000000000000000" edc:name="SRSCtl" edc:nmmrflags="0b" edc:nmmrid="432" edc:nzwidth="0x20" edc:por="00011100000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS" edc:desc="" edc:mask="0xf" edc:name="CSS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="PSS" edc:desc="" edc:mask="0xf" edc:name="PSS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="ESS" edc:desc="" edc:mask="0xf" edc:name="ESS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="EICSS" edc:desc="" edc:mask="0xf" edc:name="EICSS" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="HSS" edc:desc="" edc:mask="0xf" edc:name="HSS" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRSMap" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SRSMap" edc:nmmrflags="0c" edc:nmmrid="560" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSV0" edc:desc="" edc:mask="0xf" edc:name="SSV0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV1" edc:desc="" edc:mask="0xf" edc:name="SSV1" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV2" edc:desc="" edc:mask="0xf" edc:name="SSV2" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV3" edc:desc="" edc:mask="0xf" edc:name="SSV3" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV4" edc:desc="" edc:mask="0xf" edc:name="SSV4" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV5" edc:desc="" edc:mask="0xf" edc:name="SSV5" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV6" edc:desc="" edc:mask="0xf" edc:name="SSV6" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV7" edc:desc="" edc:mask="0xf" edc:name="SSV7" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="----------------------nnnnnnnn--" edc:cname="View_IPL" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="View_IPL" edc:nmmrflags="0d" edc:nmmrid="688" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0xff" edc:name="IPL" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SRSMAP2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SRSMAP2" edc:nmmrflags="0e" edc:nmmrid="816" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SSV8" edc:desc="" edc:mask="0xf" edc:name="SSV8" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SSV9" edc:desc="" edc:mask="0xf" edc:name="SSV9" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GTOffset" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GTOffset" edc:nmmrflags="0e" edc:nmmrid="1072" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GTOffset" edc:desc="" edc:mask="0xFFFFFFFF" edc:name="GTOffset" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
