Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/edc/PIC32MK0512GPL100.PIC
      <edc:SFRDef edc:_addr="0x1F860230" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnn---nnn" edc:cname="LATC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxx---xxx" edc:name="LATC" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxx---xxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC8" edc:desc="" edc:mask="0x1" edc:name="LATC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC9" edc:desc="" edc:mask="0x1" edc:name="LATC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC10" edc:desc="" edc:mask="0x1" edc:name="LATC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC11" edc:desc="" edc:mask="0x1" edc:name="LATC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC12" edc:desc="" edc:mask="0x1" edc:name="LATC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC13" edc:desc="" edc:mask="0x1" edc:name="LATC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATC14" edc:desc="" edc:mask="0x1" edc:name="LATC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATC15" edc:desc="" edc:mask="0x1" edc:name="LATC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860240" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnn---nnn" edc:cname="ODCC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000---000" edc:name="ODCC" edc:nzwidth="0x20" edc:por="----------------0000000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCC0" edc:desc="" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC1" edc:desc="" edc:mask="0x1" edc:name="ODCC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC2" edc:desc="" edc:mask="0x1" edc:name="ODCC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCC6" edc:desc="" edc:mask="0x1" edc:name="ODCC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC7" edc:desc="" edc:mask="0x1" edc:name="ODCC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC8" edc:desc="" edc:mask="0x1" edc:name="ODCC8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC9" edc:desc="" edc:mask="0x1" edc:name="ODCC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC10" edc:desc="" edc:mask="0x1" edc:name="ODCC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC11" edc:desc="" edc:mask="0x1" edc:name="ODCC11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC12" edc:desc="" edc:mask="0x1" edc:name="ODCC12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC13" edc:desc="" edc:mask="0x1" edc:name="ODCC13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCC14" edc:desc="" edc:mask="0x1" edc:name="ODCC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCC15" edc:desc="" edc:mask="0x1" edc:name="ODCC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860250" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnn---nnn" edc:cname="CNPUC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000---000" edc:name="CNPUC" edc:nzwidth="0x20" edc:por="----------------0000000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUC0" edc:desc="" edc:mask="0x1" edc:name="CNPUC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC1" edc:desc="" edc:mask="0x1" edc:name="CNPUC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC2" edc:desc="" edc:mask="0x1" edc:name="CNPUC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUC6" edc:desc="" edc:mask="0x1" edc:name="CNPUC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC7" edc:desc="" edc:mask="0x1" edc:name="CNPUC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC8" edc:desc="" edc:mask="0x1" edc:name="CNPUC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC9" edc:desc="" edc:mask="0x1" edc:name="CNPUC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC10" edc:desc="" edc:mask="0x1" edc:name="CNPUC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC11" edc:desc="" edc:mask="0x1" edc:name="CNPUC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC12" edc:desc="" edc:mask="0x1" edc:name="CNPUC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC13" edc:desc="" edc:mask="0x1" edc:name="CNPUC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC14" edc:desc="" edc:mask="0x1" edc:name="CNPUC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUC15" edc:desc="" edc:mask="0x1" edc:name="CNPUC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860260" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnnnnnnnn---nnn" edc:cname="CNPDC" edc:desc="" edc:grp="PORTC" edc:impl="0xffffffc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000---000" edc:name="CNPDC" edc:nzwidth="0x20" edc:por="----------------0000000000---000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDC0" edc:desc="" edc:mask="0x1" edc:name="CNPDC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC1" edc:desc="" edc:mask="0x1" edc:name="CNPDC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC2" edc:desc="" edc:mask="0x1" edc:name="CNPDC2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDC6" edc:desc="" edc:mask="0x1" edc:name="CNPDC6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC7" edc:desc="" edc:mask="0x1" edc:name="CNPDC7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC8" edc:desc="" edc:mask="0x1" edc:name="CNPDC8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC9" edc:desc="" edc:mask="0x1" edc:name="CNPDC9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC10" edc:desc="" edc:mask="0x1" edc:name="CNPDC10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC11" edc:desc="" edc:mask="0x1" edc:name="CNPDC11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC12" edc:desc="" edc:mask="0x1" edc:name="CNPDC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC13" edc:desc="" edc:mask="0x1" edc:name="CNPDC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC14" edc:desc="" edc:mask="0x1" edc:name="CNPDC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDC15" edc:desc="" edc:mask="0x1" edc:name="CNPDC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
