Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/edc/PIC32MK0512GPL100.PIC
      <edc:SFRDef edc:_addr="0x1F8850E0" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4BDIAG0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4BDIAG0" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NRERRCNT" edc:mask="0xff" edc:name="NRERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="NTERRCNT" edc:mask="0xff" edc:name="NTERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DRERRCNT" edc:mask="0xff" edc:name="DRERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="DTERRCNT" edc:mask="0xff" edc:name="DTERRCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8850F0" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:access="nnnnn-nn--nnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4BDIAG1" edc:desc="" edc:impl="0xfb3fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu--uuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4BDIAG1" edc:nzwidth="32" edc:por="xxxxx-xx--xxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EFMSGCNT" edc:mask="0xffff" edc:name="EFMSGCNT" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="NBIT0ERR" edc:mask="0x1" edc:name="NBIT0ERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NBIT1ERR" edc:mask="0x1" edc:name="NBIT1ERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NACKERR" edc:mask="0x1" edc:name="NACKERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NFORMERR" edc:mask="0x1" edc:name="NFORMERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NSTUFERR" edc:mask="0x1" edc:name="NSTUFERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NCRCERR" edc:mask="0x1" edc:name="NCRCERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DBIT0ERR" edc:mask="0x1" edc:name="DBIT0ERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBIT1ERR" edc:mask="0x1" edc:name="DBIT1ERR" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DFORMERR" edc:mask="0x1" edc:name="DFORMERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSTUFERR" edc:mask="0x1" edc:name="DSTUFERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCRCERR" edc:mask="0x1" edc:name="DCRCERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ESI" edc:mask="0x1" edc:name="ESI" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLCMM" edc:mask="0x1" edc:name="DLCMM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885100" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:access="---nnnnn-------------n-n--n-nnnn" edc:cname="CFD4TEFCON" edc:desc="" edc:impl="0x1f00052f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu-------------u-u--u-uuuu" edc:name="CFD4TEFCON" edc:nzwidth="32" edc:por="---xxxxx-------------x-x--x-xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEFNEIE" edc:mask="0x1" edc:name="TEFNEIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFHIE" edc:mask="0x1" edc:name="TEFHIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFIE" edc:mask="0x1" edc:name="TEFFIE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFOVIE" edc:mask="0x1" edc:name="TEFOVIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFTSEN" edc:mask="0x1" edc:name="TEFTSEN" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xd"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885110" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:access="----------------------------nnnn" edc:cname="CFD4TEFSTA" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------uuuu" edc:name="CFD4TEFSTA" edc:nzwidth="32" edc:por="----------------------------xxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEFNEIF" edc:mask="0x1" edc:name="TEFNEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFHIF" edc:mask="0x1" edc:name="TEFHIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFIF" edc:mask="0x1" edc:name="TEFFIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFOVIF" edc:mask="0x1" edc:name="TEFOVIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885120" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4TEFUA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4TEFUA" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TEFUA" edc:mask="0xffffffff" edc:name="TEFUA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885130" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CFD4FIFOBA" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu" edc:name="CFD4FIFOBA" edc:nzwidth="32" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOBA" edc:mask="0xffffffff" edc:name="FIFOBA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F885140" edc:_begin="0x0" edc:_end="0xbc0" edc:_modsrc="DOS-03247_can_fd_upb_v2_pic32mk.Module" edc:_refcount="4" edc:access="nnnnnnnn-nnnnnnn-----nnnn--n-n-n" edc:cname="CFD4TXQCON" edc:desc="" edc:impl="0xff7f0795" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu-uuuuuuu-----uuuu--u-u-u" edc:name="CFD4TXQCON" edc:nzwidth="32" edc:por="xxxxxxxx-xxxxxxx-----xxxx--x-x-x" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXQNIE" edc:mask="0x1" edc:name="TXQNIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXQEIE" edc:mask="0x1" edc:name="TXQEIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXATIE" edc:mask="0x1" edc:name="TXATIE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="UINC" edc:mask="0x1" edc:name="UINC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXREQ" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRESET" edc:mask="0x1" edc:name="FRESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TXPRI" edc:mask="0x1f" edc:name="TXPRI" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="TXAT" edc:mask="0x3" edc:name="TXAT" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FSIZE" edc:mask="0x1f" edc:name="FSIZE" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="PLSIZE" edc:mask="0x7" edc:name="PLSIZE" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
